Revit 2027 API
Alignment.IsValid(Element) Method
 Checks if the element is a valid alignment.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValid(
	Element element
)
Public Shared Function IsValid (
	element As Element
) As Boolean
public:
static bool IsValid(
	Element^ element
)
static member IsValid :
        element : Element -> bool
Parameters
element Element
The element to validate.
Return Value
Boolean
See Also
Reference
Alignment Class
IsValid Overload
Autodesk.Revit.DB.Infrastructure Namespace